{
  "architecture": "paper",
  "architectures": [
    "CtnetForEEGClassification"
  ],
  "att_depth": 6,
  "att_dim": 16,
  "att_heads": 2,
  "att_mlp_dim": 64,
  "auto_map": {
    "AutoConfig": "configuration_ctnet.CtnetConfig",
    "AutoModel": "modeling_ctnet.CtnetModel",
    "AutoModelForSequenceClassification": "modeling_ctnet.CtnetForEEGClassification"
  },
  "channel_names": [
    "Fz",
    "FC3",
    "FC1",
    "FCz",
    "FC2",
    "FC4",
    "C5",
    "C3",
    "C1",
    "Cz",
    "C2",
    "C4",
    "C6",
    "CP3",
    "CP1",
    "CPz",
    "CP2",
    "CP4",
    "P1",
    "Pz",
    "P2",
    "POz"
  ],
  "checkpoint_selection_metric": "mean_subject_accuracy",
  "checkpoint_selection_session": "1test",
  "classifier_dropout": 0.5,
  "depth_multiplier": 2,
  "dropout": 0.5,
  "dtype": "float32",
  "filter_time_length": 64,
  "id2label": {
    "0": "feet",
    "1": "left_hand",
    "2": "right_hand",
    "3": "tongue"
  },
  "initialization": "trained",
  "input_unit": "microvolts",
  "label2id": {
    "feet": 0,
    "left_hand": 1,
    "right_hand": 2,
    "tongue": 3
  },
  "max_position_embeddings": 100,
  "model_type": "ctnet",
  "n_channels": 22,
  "n_filters_time": 8,
  "n_times": 1000,
  "pool_time_length": 8,
  "pool_time_stride": 8,
  "positional_dropout": 0.1,
  "pretrained": true,
  "sampling_rate": 250,
  "second_filter_time_length": 16,
  "second_pool_time_length": 8,
  "second_pool_time_stride": 8,
  "train_session": "0train",
  "training_dataset": "BNCI2014_001",
  "training_subjects": [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "transformers_version": "4.57.6"
}
