{
  "architectures": [
    "CtnetForEEGClassification"
  ],
  "att_depth": 2,
  "att_dim": 64,
  "att_heads": 4,
  "att_mlp_dim": 128,
  "auto_map": {
    "AutoConfig": "configuration_ctnet.CtnetConfig",
    "AutoModel": "modeling_ctnet.CtnetModel",
    "AutoModelForSequenceClassification": "modeling_ctnet.CtnetForEEGClassification"
  },
  "dropout": 0.5,
  "filter_time_length": 25,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3
  },
  "model_type": "ctnet",
  "n_channels": 22,
  "n_filters_time": 40,
  "n_times": 1000,
  "num_labels": 4,
  "pool_time_length": 75,
  "pool_time_stride": 15,
  "sampling_rate": 250,
  "transformers_version": "4.39.0"
}
